IRP/src/Documents/ConsolidatedRetailSales/ConsolidatedRetailSales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ConsolidatedRetailSales</name>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>OpeningDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ClosingDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CashAccount</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ConsolidatedRetailSalesStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>BalanceConfirm</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CashConfirm</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TerminalConfirm</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BalanceEnd</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>BalanceReal</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>BalanceCashIn</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>BalanceRealIn</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>BalanceCashOut</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>BalanceRealOut</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>FiscalPrinter</name>
    <type>
      <types>CatalogRef.Hardware</types>
    </type>
  </attributes>
  <attributes>
    <name>ShiftNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PaymentList</name>
    <attributes>
      <name>isReturn</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentType</name>
      <type>
        <types>CatalogRef.PaymentTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentTerminal</name>
      <type>
        <types>CatalogRef.PaymentTerminals</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>RealAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Companies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainCompany</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CompanyLegalType</types>
  </type>
 </attributes>
 <attributes>
  <name>OurCompany</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostFillEmptyAmount</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostPriceTypeForEmptyAmount</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualVacation</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysVacation</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualSickLeave</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysSickLeave</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryBasicPayroll</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>MainLegalAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>BillingEmail</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EntityID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/EquipmentFiscalPrinterClient/Module.bsl
#Region API

Function ShiftSettings() Export
	
	Str = New Structure();;
	Str.Insert("Cashier", PredefinedValue("Catalog.Partners.EmptyRef"));
	Str.Insert("ДокументОснование", Undefined);
	Str.Insert("Организация", PredefinedValue("Catalog.Companies.EmptyRef"));
	Str.Insert("ТорговыйОбъект", PredefinedValue("Catalog.Stores.EmptyRef"));
	
	Str.Insert("НомерСменыККТ" , 0);
	Str.Insert("НомерЧекаККТ"  , 0);
	Str.Insert("СтатусСмены", 0);
	Str.Insert("ДатаВремя", CurrentDate());
	Str.Insert("ParametersXML", "");
	Str.Insert("ResultXML", "");
	Str.Insert("КассоваяСмена", PredefinedValue("Document.ConsolidatedRetailSales.EmptyRef"));
	Str.Insert("ТестовыеЧеки", False);
	Str.Insert("ДополнительныеПараметры", New Structure());
	Str.Insert("Результат", True);
	Str.Insert("ТекстОшибки", "");
	
	Return Str;
	
EndFunction

Function ShiftGetXMLOperationSettings() Export
	Str = New Structure;
	Str.Insert("CashierName", "");	//Mandatory
	Str.Insert("CashierINN", "");
	Str.Insert("SaleAddress", "");
	Str.Insert("SaleLocation", "");
	Return Str;
EndFunction

// Open shift.
// 
// Parameters:
//  ConsolidatedRetailSales - DocumentRef.ConsolidatedRetailSales
// 
// Returns:
//  See OpenShiftResult
Async Function OpenShift(ConsolidatedRetailSales) Export
	
	CRS = CommonFunctionsServer.GetAttributesFromRef(ConsolidatedRetailSales, "FiscalPrinter, Author");
	Settings = Await HardwareClient.FillDriverParametersSettings(CRS.FiscalPrinter);
		
	Parameters = ShiftSettings();
	ShiftGetXMLOperationSettings = ShiftGetXMLOperationSettings();
	ShiftGetXMLOperationSettings.CashierName = String(CRS.Author);
	
	Parameters.ParametersXML = EquipmentFiscalPrinterServer.ShiftGetXMLOperation(ShiftGetXMLOperationSettings);
	
	LineLength = 0;
	Result = Settings.ConnectedDriver.DriverObject.GetLineLength(Settings.ConnectedDriver.ID
																	, LineLength);
	
	DataKKT = "";
	DataKKTResult = Settings.ConnectedDriver.DriverObject.GetDataKKT(Settings.ConnectedDriver.ID
																		, DataKKT);
	If Not DataKKTResult Then
		Raise "Can not get data KKT";
	EndIf;

	Result = ShiftResultStructure();
	
	ResultInfo = Settings.ConnectedDriver.DriverObject.GetCurrentStatus(Settings.ConnectedDriver.ID
																			, Parameters.ParametersXML
																			, Parameters.ResultXML);
	If ResultInfo Then
		ShiftData = GetShiftData(Parameters.ResultXML);
		If ShiftData.ShiftState = 1 Then
			
		ElsIf ShiftData.ShiftState = 2 Then
			CommonFunctionsClientServer.ShowUsersMessage(R().EqFP_ShiftAlreadyOpened);
			Return Result;
		ElsIf ShiftData.ShiftState = 3 Then
			CommonFunctionsClientServer.ShowUsersMessage(R().EqFP_ShiftIsExpired);
			Return Result;
		EndIf;
	Else
		CommonFunctionsClientServer.ShowUsersMessage(Settings.ConnectedDriver.DriverObject.GetLastError());
		Return Result;
	EndIf;
	
	ResultInfo = Settings.ConnectedDriver.DriverObject.OpenShift(Settings.ConnectedDriver.ID
																	, Parameters.ParametersXML
																	, Parameters.ResultXML);
	If ResultInfo Then
		ShiftData = GetShiftData(Parameters.ResultXML);
		FillPropertyValues(Result, ShiftData);
		Result.Success = True;
	Else
		CommonFunctionsClientServer.ShowUsersMessage(Settings.ConnectedDriver.DriverObject.GetLastError());
	EndIf;
	
	Return Result;
EndFunction

Async Function CloseShift(ConsolidatedRetailSales) Export
	
	CRS = CommonFunctionsServer.GetAttributesFromRef(ConsolidatedRetailSales, "FiscalPrinter, Author");
	Settings = Await HardwareClient.FillDriverParametersSettings(CRS.FiscalPrinter);
		
	Parameters = ShiftSettings();
	ShiftGetXMLOperationSettings = ShiftGetXMLOperationSettings();
	ShiftGetXMLOperationSettings.CashierName = String(CRS.Author);
	
	Parameters.ParametersXML = EquipmentFiscalPrinterServer.ShiftGetXMLOperation(ShiftGetXMLOperationSettings);
	
	Result = ShiftResultStructure();
	
	ResultInfo = Settings.ConnectedDriver.DriverObject.GetCurrentStatus(Settings.ConnectedDriver.ID
																			, Parameters.ParametersXML
																			, Parameters.ResultXML);
	If ResultInfo Then
		ShiftData = GetShiftData(Parameters.ResultXML);
		If ShiftData.ShiftState = 1 Then
			CommonFunctionsClientServer.ShowUsersMessage(R().EqFP_ShiftAlreadyClosed);
			Return Result;
		ElsIf ShiftData.ShiftState = 2 Then

		ElsIf ShiftData.ShiftState = 3 Then
			
		EndIf;
	Else
		CommonFunctionsClientServer.ShowUsersMessage(Settings.ConnectedDriver.DriverObject.GetLastError());
		Return Result;
	EndIf;
	
	Result = ShiftResultStructure();
	ResultInfo = Settings.ConnectedDriver.DriverObject.CloseShift(Settings.ConnectedDriver.ID, Parameters.ParametersXML, Parameters.ResultXML);
	If ResultInfo Then
		ShiftData = GetShiftData(Parameters.ResultXML);
		FillPropertyValues(Result, ShiftData);
		Result.Success = True;
	Else
		CommonFunctionsClientServer.ShowUsersMessage(Settings.ConnectedDriver.DriverObject.GetLastError());
	EndIf;
	
	Return Result;
EndFunction

#EndRegion

#Region Private

Function ShiftResultStructure()
	ReturnValue = New Structure;
	ReturnValue.Insert("Success", False);
	ReturnValue.Insert("BacklogDocumentFirstDateTime", Date(1, 1, 1));
	ReturnValue.Insert("BacklogDocumentFirstNumber", 0);
	ReturnValue.Insert("BacklogDocumentsCounter", 0);
	ReturnValue.Insert("CashBalance", 0);
	ReturnValue.Insert("CheckNumber", 0);
	ReturnValue.Insert("CountersOperationType1", GetCountersOperationType());
	ReturnValue.Insert("CountersOperationType2", GetCountersOperationType());
	ReturnValue.Insert("CountersOperationType3", GetCountersOperationType());
	ReturnValue.Insert("CountersOperationType4", GetCountersOperationType());
	ReturnValue.Insert("DateTime", Date(1, 1, 1));
	ReturnValue.Insert("FNError", False);
	ReturnValue.Insert("FNFail", False);
	ReturnValue.Insert("FNOverflow", False);
	ReturnValue.Insert("ShiftClosingCheckNumber", 0);
	ReturnValue.Insert("ShiftNumber", 0);
	ReturnValue.Insert("ShiftState", 0);	//1 closed, 2 opened, 3 expired
	Return ReturnValue;
EndFunction

Function GetCountersOperationType()
	ReturnData = New Structure();
	ReturnData.Insert("CheckCount", 0);
	ReturnData.Insert("TotalChecksAmount", 0);
	ReturnData.Insert("CorrectionCheckCount", 0);
	ReturnData.Insert("TotalCorrectionChecksAmount", 0);	
	Return ReturnData;
EndFunction

Function GetShiftData(Value)
	Reader = New XMLReader();
	Reader.SetString(Value);
	Result = XDTOFactory.ReadXML(Reader);
	Reader.Close();
	ShiftDataParameters = Result.Parameters;
	
	ReturnData = ShiftResultStructure();
	
	For Each ReturnDataItem In ReturnData Do
		If Not ShiftDataParameters.Properties().Get(ReturnDataItem.Key) = Undefined Then
			ReturnData.Insert(ReturnDataItem.Key, TransformToTypeBySource(ShiftDataParameters[ReturnDataItem.Key], ReturnDataItem.Value));
		EndIf;
	EndDo;
	
	Return ReturnData;
EndFunction

Function TransformToTypeBySource(Data, Source)
	If Data = "" Then
		Return Data;
	EndIf;
	If TypeOf(Source) = Type("Boolean") Then
		Return Boolean(Data);
	ElsIf TypeOf(Source) = Type("Number") Then
		Return Number(Data);
	ElsIf TypeOf(Source) = Type("Date") Then
		Return ReadJSONDate(Data, JSONDateFormat.ISO);
	ElsIf TypeOf(Source) = Type("Structure") Then
		Structure = New Structure();
		For Each Item In Data.Parameters.Properties() Do 
			Structure.Insert(Item.Name, Data.Parameters[Item.Name]);
		EndDo;
		Return Structure;
	Else
		Return Data;
	EndIf;
EndFunction

#EndRegion
